[
  {
    "date": "2025-12-29",
    "title": "The Dawn of Agentic EDA: A Survey of Autonomous Digital Chip Design",
    "authors": "Zelin Zang, Yuhang Song, Bingo Wing-Kuen Ling, Aili Wang, Fuji Yang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23189v1",
    "source": "arXiv",
    "abstract": "This survey provides a comprehensive overview of the integration of Generative AI and Agentic AI within the field of Digital Electronic Design Automation (EDA). The paper first reviews the paradigmatic evolution from traditional Computer-Aided Design (CAD) to AI-assisted EDA (AI4EDA), and finally to the emerging AI-Native and Agentic design paradigms. We detail the application of these paradigms across the digital chip design flow, including the construction of agentic cognitive architectures based on multimodal foundation models, frontend RTL code generation and intelligent verification, and backend physical design featuring algorithmic innovations and tool orchestration. We validate these methodologies through integrated case studies, demonstrating practical viability from microarchitecture definition to GDSII. Special emphasis is placed on the potential for cross-stage feedback loops where agents utilize backend PPA metrics to autonomously refine frontend logic. Furthermore, this survey delves into the dual-faceted impact on security, covering novel adversarial risks, automated vulnerability repair, and privacy-preserving infrastructure. Finally, the paper critically summarizes current challenges related to hallucinations, data scarcity, and black-box tools, and outlines future trends towards L4 autonomous chip design. Ultimately, this work aims to define the emerging field of Agentic EDA and provide a strategic roadmap for the transition from AI-assisted tools to fully autonomous design engineers.",
    "title_zh": "自主式电子设计自动化时代：数字芯片自主设计综述",
    "abstract_zh": "本综述全面阐述了生成式人工智能（Generative AI）与智能体式人工智能（Agentic AI）在数字电子设计自动化（EDA）领域的融合进展。论文首先回顾了从传统计算机辅助设计（CAD）到人工智能辅助EDA（AI4EDA），再到新兴的AI原生与智能体化设计范式的演进历程。随后，详细介绍了这些范式在数字芯片设计流程中的应用，涵盖基于多模态基础模型构建的智能体认知架构、前端RTL代码生成与智能验证，以及后端物理设计中的算法创新与工具协同调度。通过集成案例研究验证了这些方法的实用性，展示了从微架构定义到GDSII输出的完整可行路径。特别强调了跨阶段反馈机制的潜力：智能体可利用后端PPA（性能、功耗、面积）指标自主优化前端逻辑设计。此外，本文深入探讨了安全性的双重影响，包括新型对抗性风险、自动化漏洞修复以及隐私保护基础设施。最后，文章批判性地总结了当前面临的挑战，如模型幻觉、数据稀缺和黑箱工具等问题，并展望了迈向L4级全自主芯片设计的未来趋势。本工作的最终目标是界定“智能体式EDA”这一新兴领域，并为实现从AI辅助工具向完全自主设计工程师的转型提供战略性路线图。"
  },
  {
    "date": "2025-12-29",
    "title": "Verifying Asynchronous Hyperproperties in Reactive Systems",
    "authors": "Raven Beutner, Bernd Finkbeiner",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23344v1",
    "source": "arXiv",
    "abstract": "Hyperproperties are system properties that relate multiple execution traces and commonly occur when specifying information-flow and security policies. Logics like HyperLTL utilize explicit quantification over execution traces to express temporal hyperproperties in reactive systems, i.e., hyperproperties that reason about the temporal behavior along infinite executions. An often unwanted side-effect of such logics is that they compare the quantified traces synchronously. This prohibits the logics from expressing properties that compare multiple traces asynchronously, such as Zdancewic and Myers's observational determinism, McLean's non-inference, or stuttering refinement. We study the model-checking problem for a variant of asynchronous HyperLTL (A-HLTL), a temporal logic that can express hyperproperties where multiple traces are compared across timesteps. In addition to quantifying over system traces, A-HLTL features secondary quantification over stutterings of these traces. Consequently, A-HLTL allows for a succinct specification of many widely used asynchronous hyperproperties. Model-checking A-HLTL requires finding suitable stutterings, which, thus far, has been only possible for very restricted fragments or terminating systems. In this paper, we propose a novel game-based approach for the verification of arbitrary $\\forall^*\\exists^*$ A-HLTL formulas in reactive systems. In our method, we consider the verification as a game played between a verifier and a refuter, who challenge each other by controlling parts of the underlying traces and stutterings. A winning strategy for the verifier then corresponds to concrete witnesses for existentially quantified traces and asynchronous alignments for existentially quantified stutterings. We identify fragments for which our game-based interpretation is complete and thus constitutes a finite-state decision procedure.",
    "title_zh": "验证反应式系统中的异步超属性",
    "abstract_zh": "超属性（Hyperproperties）是关联多个执行轨迹的系统属性，通常在指定信息流和安全策略时出现。像 HyperLTL 这样的逻辑通过显式地对执行轨迹进行量化，来表达反应式系统中的时序超属性，即关于无限执行过程中时间行为的超属性。这类逻辑的一个常见副作用是，它们以同步方式比较被量化的轨迹。这使得这些逻辑无法表达需要异步比较多条轨迹的属性，例如 Zdancewic 与 Myers 提出的观测确定性（observational determinism）、McLean 的非推断性（non-inference），或步进细化（stuttering refinement）。\n\n本文研究了一种异步 HyperLTL（A-HLTL）变体的模型检测问题。A-HLTL 是一种时序逻辑，能够表达在不同时间步上跨轨迹进行比较的超属性。除了对系统轨迹进行量化外，A-HLTL 还引入了对轨迹“步进”（stuttering）的二次量化，从而可以简洁地描述许多广泛使用的异步超属性。然而，A-HLTL 的模型检测需要寻找合适的步进方式，而迄今为止，这种方法仅适用于非常受限的片段或终止性系统。\n\n在本文中，我们提出了一种基于博弈的新方法，用于验证反应式系统中任意形如 $\\forall^*\\exists^*$ 的 A-HLTL 公式。我们的方法将验证过程视为验证者（verifier）与反例者（refuter）之间的一场博弈，双方通过控制底层轨迹及其步进的部分内容相互挑战。验证者的获胜策略对应于存在量化的轨迹的具体见证，以及存在量化的步进所对应的异步对齐方式。我们识别出了一些片段，在这些片段上我们的博弈语义是完备的，因此构成了有限状态的判定过程。"
  },
  {
    "date": "2025-12-29",
    "title": "An Empirical Study of Generative AI Adoption in Software Engineering",
    "authors": "Görkem Giray, Onur Demirörs, Marcos Kalinowski, Daniel Mendez",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23327v1",
    "source": "arXiv",
    "abstract": "Context. GenAI tools are being increasingly adopted by practitioners in SE, promising support for several SE activities. Despite increasing adoption, we still lack empirical evidence on how GenAI is used in practice, the benefits it provides, the challenges it introduces, and its broader organizational and societal implications. Objective. This study aims to provide an overview of the status of GenAI adoption in SE. It investigates the status of GenAI adoption, associated benefits and challenges, institutionalization of tools and techniques, and anticipated long term impacts on SE professionals and the community. Results. The results indicate a wide adoption of GenAI tools and how they are deeply integrated into daily SE work, particularly for implementation, verification and validation, personal assistance, and maintenance-related tasks. Practitioners report substantial benefits, most notably reduction in cycle time, quality improvements, enhanced support in knowledge work, and productivity gains. However, objective measurement of productivity and quality remains limited in practice. Significant challenges persist, including incorrect or unreliable outputs, prompt engineering difficulties, validation overhead, security and privacy concerns, and risks of overreliance. Institutionalization of tools and techniques seems to be common, but it varies considerably, with a strong focus on tool access and less emphasis on training and governance. Practitioners expect GenAI to redefine rather than replace their roles, while expressing moderate concern about job market contraction and skill shifts.",
    "title_zh": "生成式人工智能在软件工程中采用的实证研究",
    "abstract_zh": "背景：生成式人工智能（GenAI）工具在软件工程（SE）从业者中的应用日益广泛，有望为多项软件工程活动提供支持。尽管采用率不断提高，但我们仍缺乏关于GenAI在实践中如何使用、其带来的益处与挑战，以及其更广泛的组织和社会影响的实证证据。\n\n目标：本研究旨在概述生成式人工智能在软件工程领域采用的现状，探讨其采用情况、相关收益与挑战、工具与技术的制度化程度，以及对软件工程专业人员和整个社区预期的长期影响。\n\n结果：研究结果表明，生成式人工智能工具已被广泛采用，并深度融入日常软件工程工作中，尤其应用于实现、验证与确认、个人辅助以及维护相关任务中。从业者报告了显著的益处，最突出的是缩短周期时间、提升质量、加强知识工作的支持以及提高生产力。然而，在实践中对生产力和质量的客观衡量仍然有限。持续存在的重大挑战包括输出错误或不可靠、提示工程困难、验证负担加重、安全与隐私问题，以及过度依赖的风险。工具与技术的制度化已较为普遍，但程度差异较大，目前主要关注工具访问权限，而在培训和治理方面的投入较少。从业者普遍认为生成式人工智能将重新定义而非取代他们的角色，同时对就业市场萎缩和技能需求变化表现出适度担忧。"
  },
  {
    "date": "2025-12-29",
    "title": "On Conformant Planning and Model-Checking of $\\exists^*\\forall^*$ Hyperproperties",
    "authors": "Raven Beutner, Bernd Finkbeiner",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23324v1",
    "source": "arXiv",
    "abstract": "We study the connection of two problems within the planning and verification community: Conformant planning and model-checking of hyperproperties. Conformant planning is the task of finding a sequential plan that achieves a given objective independent of non-deterministic action effects during the plan's execution. Hyperproperties are system properties that relate multiple execution traces of a system and, e.g., capture information-flow and fairness policies. In this paper, we show that model-checking of $\\exists^*\\forall^*$ hyperproperties is closely related to the problem of computing a conformant plan. Firstly, we show that we can efficiently reduce a hyperproperty model-checking instance to a conformant planning instance, and prove that our encoding is sound and complete. Secondly, we establish the converse direction: Every conformant planning problem is, itself, a hyperproperty model-checking task.",
    "title_zh": "关于 $\\exists^*\\forall^*$ 超属性的顺应性规划与模型检测",
    "abstract_zh": "我们研究了规划与验证领域中两个问题之间的联系：共形规划（Conformant planning）和超属性（hyperproperties）的模型检测。共形规划的任务是寻找一个顺序计划，使得该计划在执行过程中无论出现何种非确定性动作效应，都能实现给定的目标。超属性是一类涉及系统多个执行轨迹的系统属性，可用于描述信息流、公平性策略等。本文表明，对形如 $\\exists^*\\forall^*$ 的超属性进行模型检测，与计算共形计划的问题密切相关。首先，我们展示了如何将一个超属性模型检测实例高效地规约到一个共形规划实例，并证明了该编码是可靠且完备的。其次，我们建立了反向方向的联系：每一个共形规划问题本身就是一个超属性模型检测任务。"
  },
  {
    "date": "2025-12-29",
    "title": "Checking Satisfiability of Hyperproperties using First-Order Logic",
    "authors": "Raven Beutner, Bernd Finkbeiner",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23332v1",
    "source": "arXiv",
    "abstract": "Hyperproperties are system properties that relate multiple execution traces and occur, e.g., when specifying security and information-flow properties. Checking if a hyperproperty is satisfiable has many important applications, such as testing if some security property is contradictory, or analyzing implications and equivalences between information-flow policies. In this paper, we present FOLHyper, a tool that can automatically check satisfiability of hyperproperties specified in the temporal logic HyperLTL. FOLHyper reduces the problem to an equisatisfiable first-order logic (FOL) formula, which allows us to leverage FOL solvers for the analysis of hyperproperties. As such, FOLHyper is applicable to many formulas beyond the decidable $\\exists^*\\forall^*$ fragment of HyperLTL. Our experiments show that FOLHyper is particularly useful for proving that a formula is unsatisfiable, and complements existing bounded approaches to satisfiability.",
    "title_zh": "使用一阶逻辑检查超属性的可满足性",
    "abstract_zh": "超属性（Hyperproperties）是关联多个执行轨迹的系统属性，例如在指定安全性和信息流属性时会出现。检查一个超属性是否可满足具有许多重要应用，比如测试某个安全属性是否存在矛盾，或分析信息流策略之间的蕴含关系和等价性。本文中，我们提出了FOLHyper工具，该工具能够自动检查用时序逻辑HyperLTL表示的超属性的可满足性。FOLHyper将此问题归约为一个等可满足的一阶逻辑（FOL）公式，从而可以利用一阶逻辑求解器对超属性进行分析。因此，FOLHyper适用于许多超出HyperLTL中可判定的$\\exists^*\\forall^*$片段的公式。我们的实验表明，FOLHyper在证明公式不可满足方面尤为有效，并且补充了现有的基于有界方法的可满足性分析手段。"
  },
  {
    "date": "2025-12-29",
    "title": "Fuzzilicon: A Post-Silicon Microcode-Guided x86 CPU Fuzzer",
    "authors": "Johannes Lenzen, Mohamadreza Rostami, Lichao Wu, Ahmad-Reza Sadeghi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.23438v1",
    "source": "arXiv",
    "abstract": "Modern CPUs are black boxes, proprietary, and increasingly characterized by sophisticated microarchitectural flaws that evade traditional analysis. While some of these critical vulnerabilities have been uncovered through cumbersome manual effort, building an automated and systematic vulnerability detection framework for real-world post-silicon processors remains a challenge. In this paper, we present Fuzzilicon, the first post-silicon fuzzing framework for real-world x86 CPUs that brings deep introspection into the microcode and microarchitectural layers. Fuzzilicon automates the discovery of vulnerabilities that were previously only detectable through extensive manual reverse engineering, and bridges the visibility gap by introducing microcode-level instrumentation. At the core of Fuzzilicon is a novel technique for extracting feedback directly from the processor's microarchitecture, enabled by reverse-engineering Intel's proprietary microcode update interface. We develop a minimally intrusive instrumentation method and integrate it with a hypervisor-based fuzzing harness to enable precise, feedback-guided input generation, without access to Register Transfer Level (RTL). Applied to Intel's Goldmont microarchitecture, Fuzzilicon introduces 5 significant findings, including two previously unknown microcode-level speculative-execution vulnerabilities. Besides, the Fuzzilicon framework automatically rediscover the $μ$Spectre class of vulnerabilities, which were detected manually in the previous work. Fuzzilicon reduces coverage collection overhead by up to 31$\\times$ compared to baseline techniques and achieves 16.27% unique microcode coverage of hookable locations, the first empirical baseline of its kind. As a practical, coverage-guided, and scalable approach to post-silicon fuzzing, Fuzzilicon establishes a new foundation to automate the discovery of complex CPU vulnerabilities.",
    "title_zh": "Fuzzilicon：一种基于微码引导的x86 CPU后硅模糊测试工具",
    "abstract_zh": "现代CPU如同黑箱，具有专有性，且日益暴露出复杂的微架构缺陷，这些缺陷往往能逃避传统分析方法的检测。尽管其中一些关键漏洞已通过繁琐的手工方式被发现，但为现实世界中流片后的处理器构建一个自动化、系统化的漏洞检测框架仍是一项挑战。本文提出了Fuzzilicon，这是首个面向真实x86 CPU的流片后模糊测试框架，能够深入微码（microcode）和微架构层进行深度洞察。Fuzzilicon实现了对以往只能通过大量手动逆向工程才能发现的漏洞的自动化检测，并通过引入微码级插桩技术，填补了可观测性的空白。\n\nFuzzilicon的核心是一种新颖的技术，能够直接从处理器的微架构中提取反馈信息，其基础是对英特尔专有的微码更新接口进行逆向工程。我们开发了一种侵入性极小的插桩方法，并将其与基于虚拟机管理程序（hypervisor）的模糊测试框架集成，从而在无需访问寄存器传输级（RTL）代码的前提下，实现精确的、反馈驱动的输入生成。在应用于英特尔Goldmont微架构时，Fuzzilicon取得了五项重要发现，其中包括两个此前未知的微码级推测执行漏洞。此外，该框架还自动重现了此前需通过人工手段发现的$μ$Spectre类漏洞。\n\n相比基线技术，Fuzzilicon将覆盖率收集的开销降低了高达31倍，并实现了对可插桩位置16.27%的独特微码覆盖率，这是此类实证基准的首次建立。作为一种实用、覆盖引导且可扩展的流片后模糊测试方法，Fuzzilicon为自动化发现复杂CPU漏洞奠定了新的基础。"
  },
  {
    "date": "2025-12-29",
    "title": "Logic for Computer Engineering",
    "authors": "Vladimir Hahanov, Marina Abashidze, Abdullayev Vugar Hacimahmud, Tetiana Borysenko, Hanna Khakhanova, Nataliya Maksymova, Irina Hahanova",
    "publish": "2025 IEEE East-West Design &amp;amp; Test Symposium (EWDTS)",
    "url": "https://doi.org/10.1109/ewdts67441.2025.11303690",
    "source": "IEEE",
    "abstract": "The system issues of using computing logic to solve practical engineering problems are considered. It is demonstrated that the logic in a computer encompasses the existence and development of all emerging architectures, models, and algorithms. Relations are given that show the commonality of logical data structures for various types of computing, including quantum and Artificial Intelligence. A map of science and practice is provided, illustrating the relationship between key concepts such as science, engineering, education, and scientific results, all of which are essential for the creative activities of scientists, students, and engineers. A map of model minimization, its pros and cons for verification procedures, is given modelling for simulation. It is shown that to perform verification successfully, it is necessary to meet the requirements of testable standards to reduce the time for modeling and simulation procedures. To do this, it is essential to redesign (remodel) the digital product to maximize the enlargement of the logical elements of the new circuit model. A vector-matrix technology is presented for building a map to test functions and structures without relying on algorithms or processor instructions. Mechanisms for rendering any structure, function, truth table, and matrix using graph construction for any logical vector are given. Structurally logical constants are determined, enabling the solution of the problem of modeling a testing map for functionality or structure in a more technologically advanced manner.",
    "title_zh": "计算机工程逻辑",
    "abstract_zh": "考虑了使用计算逻辑解决实际工程问题时存在的系统性问题。研究表明，计算机中的逻辑涵盖了所有新兴架构、模型和算法的存在与发展。文中给出了各种计算形式（包括量子计算和人工智能）中逻辑数据结构共性的关系，并提供了一幅科学与实践的关系图，阐明了科学、工程、教育和科研成果等关键概念之间的联系，这些要素对于科学家、学生和工程师的创造性活动至关重要。同时给出了模型简化的路线图，分析了其在验证过程中的优缺点以及用于仿真的建模方法。研究表明，要成功完成验证，必须满足可测试性标准的要求，以缩短建模与仿真所需的时间。为此，必须对数字产品进行重新设计（重构），以最大程度地扩展新电路模型中的逻辑元素。提出了一种矢量-矩阵技术，用于构建无需依赖算法或处理器指令即可测试功能与结构的映射图。给出了通过图构造方法实现任意结构、函数、真值表和矩阵在任意逻辑矢量上的表示机制。确定了结构化逻辑常量，使得以更先进的技术手段解决功能或结构测试图的建模问题成为可能。"
  },
  {
    "date": "2025-12-29",
    "title": "Circuits for Secure Root-of-Trust: TRNG, PUF, Attack-Resistant Cryptographic Accelerators [Feature]",
    "authors": "Sanu K. Mathew, Raghavan Kumar, Vivek De",
    "publish": "IEEE Circuits and Systems Magazine",
    "url": "https://doi.org/10.1109/mcas.2025.3595508",
    "source": "IEEE",
    "abstract": "Silicon-embedded root-of-trust circuits such as True Random Number Generators (TRNG) and Physically Unclonable Functions (PUF) are foundational primitives that generate dynamic and static entropy essential for data security and privacy applications. At the same time, secure platforms are vulnerable to physical side-channel and fault-injection attacks that attempt to steal embedded secret keys/IDs. This article describes all-digital area-efficient implementations of TRNGs and PUFs that generate cryptographic quality random bitstreams with tolerance to process/voltage/temperature variations. These include: (a) Ring-oscillator-based TRNG implementations that employ multiple injected-edges and beat frequency detectors to harvest and convert thermal noise-induced jitter into random bitstreams with throughput and energy-efficiency of 23Mbps and 15Mbps/mW respectively; (b) SRAM PUF with data-remanence bit-masking technique to identify 100% stable bitcells; (c) Unified PUF-TRNG with a common-entropy source and self-calibrating Von Neumann extractor circuits generating PUF/TRNG random bit throughput of 0.56/1.48Gbps with 0.9996/0.99997 static/dynamic entropy respectively. A reconfigurable AES accelerator with minimum-traces-to-disclosure (MTD)<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$&gt;1\\text{B}$ </tex-math></inline-formula> traces in on-demand SCA-resistant mode, while also providing a <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$2.2\\times $ </tex-math></inline-formula> boost in encryption performance during a dual-core mode of operation is also described. Finally, a self-checking AES engine that uses arithmetic and parity checkers for real-time detection of laser and voltage-based attacks with up to 99.99% fault coverage is described.",
    "title_zh": "用于安全信任根的电路：真随机数生成器、物理不可克隆函数、抗攻击密码加速器 [专题]",
    "abstract_zh": "诸如真随机数生成器（TRNG）和物理不可克隆函数（PUF）等嵌入硅基的可信根电路，是数据安全与隐私应用中生成动态和静态熵的基础性原语。与此同时，安全平台容易受到物理侧信道攻击和故障注入攻击，这些攻击试图窃取嵌入的密钥或身份标识。本文介绍了一种全数字、面积高效的TRNG和PUF实现方案，能够生成具备密码学质量的随机比特流，并对工艺、电压和温度（PVT）变化具有良好的容忍性。具体包括：（a）基于环形振荡器的TRNG实现，采用多边沿注入和差频检测技术，将热噪声引起的抖动采集并转换为随机比特流，吞吐量达23 Mbps，能效达15 Mbps/mW；（b）采用数据剩磁位掩码技术的SRAM PUF，可识别出100%稳定的位单元；（c）统一的PUF-TRNG架构，共享同一熵源，并结合自校准冯·诺依曼提取电路，分别以0.56 Gbps和1.48 Gbps的速率生成PUF和TRNG随机比特，其静态熵和动态熵分别高达0.9996和0.99997。此外，本文还描述了一种可重构AES加速器，在按需启用抗侧信道攻击（SCA-resistant）模式时，最小泄露追踪次数（MTD）超过10亿次，同时在双核运行模式下加密性能提升达2.2倍。最后，介绍了一种自检式AES引擎，通过算术和奇偶校验机制实现实时检测激光和电压类故障攻击，故障检测覆盖率高达99.99%。"
  },
  {
    "date": "2025-12-29",
    "title": "Testability-based Hardware Trojan Design",
    "authors": "Shreoshi Chattopadhyay, Smruthi Sajan Varier, M Nirmala Devi",
    "publish": "2025 IEEE International Conference on Electronics, Computing and Communication Technologies (CONECCT)",
    "url": "https://doi.org/10.1109/conecct65861.2025.11306554",
    "source": "IEEE",
    "abstract": "Hardware Trojans (HTs) are modifications of an original circuit during design and manufacturing of integrated circuits (ICs). These modifications have various effects on the circuit, such as leakage of information, reduced reliability etc. which are malicious in nature. The stealthiness of an HT can be determined by its ability to be not detected during testing. Design and insertion of Hardware Trojans provides insight into an attackers’ perspective, enabling us to identify nodes vulnerable to HT insertion in various circuits, and selection of logic elements for designing HTs. This approach can help us in designing robust circuits that are resilient to Hardware Trojans.",
    "title_zh": "基于可测试性的硬件木马设计",
    "abstract_zh": "硬件木马（HT）是指在集成电路（IC）的设计和制造过程中对原始电路进行的恶意修改。这些修改会对电路产生多种不良影响，例如信息泄露、可靠性降低等，具有明显的恶意性质。硬件木马的隐蔽性取决于其在测试过程中不被检测到的能力。研究硬件木马的设计与植入方法，有助于从攻击者的角度理解其行为，从而识别出各类电路中易受硬件木马植入的脆弱节点，并合理选择用于构建硬件木马的逻辑单元。这一方法有助于我们设计出能够抵御硬件木马攻击的鲁棒性电路。"
  },
  {
    "date": "2025-12-29",
    "title": "Formal Analysis of Fault Propagation in Complex Digital Systems",
    "authors": "Damiano Zuccala, Samuel Hon, Mohammad Reza Heidari Iman, Jean-Marc Daveau, Philippe Roche, Katell Morin-Allory",
    "publish": "Proceedings of the International Symposium on Formal Methods and Models for System Design",
    "url": "https://doi.org/10.1145/3742875.3754691",
    "source": "ACM",
    "abstract": "None",
    "title_zh": "复杂数字系统中故障传播的形式化分析",
    "abstract_zh": "None"
  },
  {
    "date": "2025-12-29",
    "title": "Implementation of I2C Protocol with Adaptive Baud Rate for N Number of Bits Using VERILOG",
    "authors": "S Aparna, C. Padma",
    "publish": "2025 7th International Conference on Control Systems, Mathematical Modeling, Automation and Energy Efficiency (SUMMA)",
    "url": "https://doi.org/10.1109/summa68668.2025.11302299",
    "source": "IEEE",
    "abstract": "For low-speed peripherals in embedded systems, the Inter-Integrated Circuit (I2C) protocol is a popular serial communication standard. In order to accommodate variable communication speeds depending on system requirements, this paper outlines the construction of an I2C protocol with an adaptable baud rate. The design is appropriate for FPGA-based applications because it is built using Verilog HDL. N-bit data width is supported by the suggested system, enabling capability for a range of applications. To maximize efficiency and minimize battery usage, the adaptive baud rate system constantly modifies the transmission speed. Key elements of the I2C master-slave communication framework include clock stretching, data transmission/reception, start/stop condition detection, and acknowledgment processing. Results from simulation and synthesis show how well the architecture works to provide dependable, fast communication while preserving compatibility. A result from simulation and synthesis is showing how well the design works to achieve dependable, fast communication while being compatible with common I2C devices. Applications need low power consumption and adjustable data transfer speed, effective serial transmission, including FPGA-based embedded systems, real-time data gathering, and sensor interface would benefit greatly from the suggested approach.",
    "title_zh": "使用VERILOG实现支持自适应波特率的I2C协议（适用于N位数据）",
    "abstract_zh": "在嵌入式系统中，针对低速外设，内部集成电路（I2C）协议是一种流行的串行通信标准。为了根据系统需求适应可变的通信速率，本文提出了一种具有自适应波特率的I2C协议构建方案。该设计采用Verilog HDL实现，适用于基于FPGA的应用。所提出的系统支持N位数据宽度，能够满足多种应用场景的需求。自适应波特率系统通过持续调整传输速度，以提高效率并降低功耗。该I2C主从通信架构的关键功能包括时钟延展、数据收发、起始/停止条件检测以及应答处理。仿真与综合结果表明，该架构能够在保持兼容性的同时，实现可靠且高效的通信。仿真和综合结果显示，该设计方案能够有效实现稳定、快速的通信，并与常见的I2C设备兼容。对于需要低功耗、可调节数据传输速率以及高效串行传输的应用，如基于FPGA的嵌入式系统、实时数据采集和传感器接口等，该方法具有显著优势。"
  },
  {
    "date": "2025-12-29",
    "title": "Research on the Application of Artificial Intelligence in Integrated Circuit Design",
    "authors": "Xueqi Wan, Deen Liu, Changpeng Yu, Qing Xu",
    "publish": "Proceedings of the 4th International Conference on Artificial Intelligence and Intelligent Information Processing",
    "url": "https://doi.org/10.1145/3778534.3778544",
    "source": "ACM",
    "abstract": "None",
    "title_zh": "人工智能在集成电路设计中的应用研究",
    "abstract_zh": "None"
  },
  {
    "date": "2025-12-29",
    "title": "DM-SCT: Side-Channel Trace Generation Via Attention-Enhanced Diffusion Model",
    "authors": "Yuxuan Meng, Baosheng Wang, Qianqian Xing, Xiaofeng Wang",
    "publish": "2025 IEEE International Performance, Computing, and Communications Conference (IPCCC)",
    "url": "https://doi.org/10.1109/ipccc66453.2025.11304629",
    "source": "IEEE",
    "abstract": "Deep Learning-based Side-Channel Analysis (DLSCA) has demonstrated its potent attack capability against cryptographic systems, enabling the extraction of secret information from leaked physical signal traces. Unfortunately, the availability of real traces for classifier training is often limited due to restricted data collection or protective countermeasures. The generation and enhancement of signal trace is crucial in practical DL-SCA analysis. Existing methods often struggle to accurately model the feature distribution of real traces, and their applicability to emerging post-quantum cryptographic (PQC) algorithms remains unexplored. In this paper, we propose DMSCT, an attention-enhanced diffusion model framework for side-channel trace generation. DM-SCT precisely models the feature distributions of real traces through a conditional injection mechanism and an enhanced attention mechanism. We evaluate DM-SCT across three PQC algorithms: NTRU, Saber, and Kyber, demonstrating its ability to faithfully replicate the leakage features of original side-channel traces. By integrating DM-SCT into DL-SCA, we validate its practical efficacy. Compared to training with real traces alone, DM-SCT improves the accuracy of recovering individual key coefficients by 0.62% to 1.6%. Furthermore, DM-SCT reduces the required number of real training traces by 20% to 25%, outperforming state-of-the-art trace generation methods.",
    "title_zh": "DM-SCT：基于注意力增强扩散模型的侧信道迹生成",
    "abstract_zh": "基于深度学习的侧信道分析（DLSCA）已展现出对密码系统的强大攻击能力，能够从泄露的物理信号迹中提取秘密信息。然而，由于数据采集受限或防护性对抗措施的存在，用于分类器训练的真实迹通常难以获取。因此，在实际的DL-SCA分析中，信号迹的生成与增强至关重要。现有方法往往难以准确建模真实迹的特征分布，且其在新兴的后量子密码（PQC）算法中的适用性尚未得到探索。本文提出DMSCT——一种注意力增强的扩散模型框架，用于侧信道迹生成。DM-SCT通过条件注入机制和增强的注意力机制，精确地建模了真实迹的特征分布。我们在三种PQC算法（NTRU、Saber和Kyber）上对DM-SCT进行了评估，结果表明其能够高度还原原始侧信道迹的泄漏特征。通过将DM-SCT集成到DL-SCA中，我们验证了其实用有效性。与仅使用真实迹训练相比，DM-SCT使单个密钥系数恢复的准确率提升了0.62%至1.6%；同时，所需的真实训练迹数量减少了20%至25%，优于当前最先进的迹生成方法。"
  },
  {
    "date": "2025-12-29",
    "title": "Design of Digital Beam Steering Network with Early Verification for Active Phased Array Radars",
    "authors": "Taniza Roy, Abhinandan Sarkar, Shreeshail, Jayabrata Chakrabarty, M Sheik Althaf",
    "publish": "2025 IEEE International Conference on Electronics, Computing and Communication Technologies (CONECCT)",
    "url": "https://doi.org/10.1109/conecct65861.2025.11306602",
    "source": "IEEE",
    "abstract": "Modern phased array radars are equipped with large number of phase shifters along with antenna elements in the front end of the system to accomplish beam steering. Beam steering directs the main lobe of a radiation pattern by adjusting the relative phases of these phase shifters of the antenna elements. The work puts forward design of a hierarchical digital beam steering network with programmable controllers at each level responsible for computation of the beam parameters such as phase and amplitude values for each radiating element of the radar for beam steering requirements in different modes of operation of radar. The design is also responsible for the beam synchronization with respect to the other subsystems of the radar and preparation of multiple control messages per burst to be sent to other subsystems for synchronised operation of the radar. In this work development and verification of the design are conducted concurrently and integrated throughout the design process enabling early verification of the design with respect to requirements. A structured design implementation is followed comprising of stages of requirements capture, conceptual design, detailed design followed by test plans with traceability matrix and rigorous testing which improves development efficiency and minimizes time spent on testing. The designed system has the capability of automatic remote update of software & firmware of the system.",
    "title_zh": "用于有源相控阵雷达的数字波束扫描网络设计及早期验证",
    "abstract_zh": "现代相控阵雷达在系统前端的天线单元上配备了大量移相器，以实现波束指向控制。波束指向通过调节各天线单元移相器之间的相对相位，从而引导辐射方向图的主瓣方向。本研究提出了一种分层式数字波束控制网络设计，每一层级均配备可编程控制器，负责计算雷达在不同工作模式下各辐射单元所需的波束参数（如相位和幅度值）。该设计还负责与雷达其他子系统进行波束同步，并在每个脉冲周期内生成多条控制信息，发送至其他子系统以实现雷达的同步运行。本研究在设计过程中同步开展开发与验证工作，将验证活动贯穿整个设计流程，从而实现对设计需求的早期验证。设计实施采用结构化方法，包括需求采集、概念设计、详细设计、测试计划制定（含可追溯性矩阵）以及严格的测试流程，有效提高了开发效率并减少了测试所耗费的时间。所设计的系统具备软件与固件远程自动更新的能力。"
  },
  {
    "date": "2025-12-29",
    "title": "Generative Diffusion Models for Test Pattern Synthesis in VLSI : Enhancing Fault Coverage and Silicon Lifecycle Management",
    "authors": "Tanuj Mathur, Mohan Vamsi Musunuru, Naveen Kumar Siripuram, Prabhu Muthusamy, Bhargav Kumar Konidena",
    "publish": "2025 IEEE East-West Design &amp;amp; Test Symposium (EWDTS)",
    "url": "https://doi.org/10.1109/ewdts67441.2025.11303688",
    "source": "IEEE",
    "abstract": "The challenges of making semiconductor technologies work reliably, in terms of yield, fault-tolerance, have escalated dramatically, due to the rapid scale-down into the nanoscale regime, and these challenges are even more acute in very-large-scale integration (VLSI) systems. Traditional Automatic Test Pattern Generation (ATPG) tools, well known as the backbone of digital verification, are increasingly not keeping up with the stochastic and dynamic fault model of the advanced nodes. The techniques tend to overedit to a priori fault models, like stuck-at or transition fault models, and thus are not very flexible to newer defect patterns. Furthermore, their over-reliance on exhaustive backtracking and deterministic search, inject too much computational overhead and redundant test vectors that weaken efficiency while managing silicon lifecycle (SLM). Enter recent cutting-edge developments in generative artificial intelligence (GenAI) the prospect of probabilistic models learning complicated patterns of defect incidence, and the apparent need to revisit traditional to the world understanding of diffusional phenomena. Of these, diffusion models are notable in the variety and high quality of the samples of data they are able to produce by iteratively removing noise using generative annealing, rendering them useful at preserving distributional diversity yet alleviating mode collapse, one of the more faults of generative adversarial networks (GANs). In this paper, we develop a Generative Diffusion Model (GDM) framework that is automatic test pattern synthesis oriented in nanoscale VLSI systems. Wide-scale data consisting of defect and failure trace data (combined with benchmark circuit data) is used to train fault-aware representations that generalize beyond classical fault models. Incorporating such an approach into an SLM pipeline can enable a model to be adaptively retrained using incremental defect data such that the ultimate relevance is maintained throughout the device life cycle. Experimental results on the ITC-99 benchmark circuits show a 22 percent enhancement in fault coverage over the traditional ATPG and GAN-based synthesis and a 40 percent decrease in run time, and, further, it produces statistically diverse test vectors with no addition of test vectors. The scalability of the approach to medium-to-large circuits is further demonstrated by a detailed case study and demonstrates a greater diversity of fault activation in a circuit with increased robustness. These findings indicate that there would be a paradigm shift of the application of electronic tests strategy and diffusion-driven synthesis stands tall as a viable and dynamic solution to and management of reliable microelectronic devices.",
    "title_zh": "用于VLSI测试图形生成的生成扩散模型：提升故障覆盖率和芯片生命周期管理",
    "abstract_zh": "由于半导体技术迅速向纳米尺度缩小，其在良率和容错性方面的可靠性挑战已急剧加剧，而在超大规模集成电路（VLSI）系统中，这些挑战尤为突出。传统的自动测试图形生成（ATPG）工具作为数字验证的支柱，正越来越难以跟上先进工艺节点中随机性和动态性故障模型的发展步伐。这些技术往往过度依赖于预先设定的故障模型（如固定故障或转换故障模型），因此对新型缺陷模式缺乏灵活性。此外，它们过度依赖穷举回溯和确定性搜索方法，导致在管理硅生命周期（SLM）过程中引入过多计算开销和冗余测试向量，从而降低了效率。\n\n近年来，生成式人工智能（GenAI）的前沿进展为应对这一挑战带来了新希望：概率模型能够学习复杂的缺陷发生模式，促使我们重新审视传统上对扩散现象的理解。其中，扩散模型因其能够通过生成退火方式迭代去噪，生成种类丰富且高质量的数据样本而备受关注。这种方法不仅有助于保持数据分布的多样性，还能有效缓解生成对抗网络（GANs）常见的“模式崩溃”问题。\n\n本文提出了一种面向纳米级VLSI系统的生成式扩散模型（GDM）框架，用于自动测试图形合成。该框架利用包含缺陷与失效轨迹数据以及基准电路数据的大规模数据集，训练出能够超越传统故障模型的、具备故障感知能力的表征模型。将此方法集成到SLM流程中，可使模型根据增量获取的缺陷数据进行自适应再训练，从而在整个器件生命周期内持续保持其有效性与相关性。\n\n在ITC-99基准电路上的实验结果表明，相较于传统ATPG和基于GAN的合成方法，本方法实现了22%的故障覆盖率提升，运行时间减少40%，并且在未增加测试向量数量的前提下生成了统计上更具多样性的测试向量。通过对中大型电路的详细案例研究进一步验证了该方法的良好可扩展性，并显示出更高的故障激活多样性及更强的电路鲁棒性。这些发现表明，电子测试策略将迎来范式转变，而由扩散驱动的合成方法将成为实现可靠微电子器件设计与管理的一种可行且动态的解决方案。"
  },
  {
    "date": "2025-12-29",
    "title": "Logic for Bus Interconnect Testing",
    "authors": "Vladimir Hahanov, David Devadze, Zaza Davitadze, Svetlana Chumachenko, Eugenia Litvinova, Volodymyr Obrizan",
    "publish": "2025 IEEE East-West Design &amp;amp; Test Symposium (EWDTS)",
    "url": "https://doi.org/10.1109/ewdts67441.2025.11303649",
    "source": "IEEE",
    "abstract": "Chiplet is the technological and structural architecture of an emerging computer system. It is an architecture that integrates heterogeneous components such as SoC, SiP, multichip, package, silicon die, and CPU. These structural components form the logical architectures: Chiplet GPU, Chiplet Memory, Chiplet I/O, Chiplet Interconnects. For the market, chip-let has a clear advantage over Monolithic Chips, which is determined by the following properties: Improved Yield, Flexibility, Scalability, and Heterogeneous Integration. As part of emerging computing, a Chiplet is just logic, represented by structures and functions, and nothing else. Chiplet Interconnects are no exception – this is also logic. A systematic approach to modeling, simulation, and testing the logic of Chiplet Interconnects, the model of which is represented by a logical vector, is proposed. The basic paradigm is that any logic should be tested systematically against logical faults that are in the good-value model of the structure or functionality, either explicitly or implicitly. Any physical defects in components or bus Interconnects in the Chiplet architecture manifest as logic faults. Defects violate the logic of any computing device, including bus structures. This means that any physical defects manifest themselves as logical faults. This means generating system tests that cover combinations of logic faults. A Modelling test card is offered, which is a logical relationship between a comprehensive test and all combinations of logic faults. A logic vector is all you need to model a Chiplet Interconnects test map in three matrix operations. As well as any structure and functionality, it can be represented by a logical vector for modeling a test map. In addition, a logical vector is also a data structure for graph rendering of the validity of a process or phenomenon model. A logical vector is the simplest model that is convenient for simulating on a computer and rendering the results for a human. Modeling and rendering on the logical vector harmoniously complement each other in solving market problems. Examples and processing time of bus, graph structures, and functionalities for modeling a test map and graph rendering models are given. All mechanisms for modeling and rendering test maps for functions and structures are embedded in the Python language codes, which are exposed in cyberspace as an open-source application.",
    "title_zh": "总线互连测试的逻辑",
    "abstract_zh": "小芯片（Chiplet）是一种新兴计算机系统的技术和结构架构，它集成了诸如SoC、SiP、多芯片、封装、硅裸片和CPU等异构组件。这些结构单元构成了逻辑架构：小芯片GPU、小芯片内存、小芯片I/O以及小芯片互连。在市场层面，小芯片相较于单片芯片（Monolithic Chips）具有明显优势，这由其以下特性决定：更高的良率、灵活性、可扩展性以及异构集成能力。作为新兴计算的一部分，小芯片本质上仅表现为逻辑，体现为特定的结构与功能，别无其他。小芯片互连也不例外——它同样属于逻辑范畴。\n\n本文提出了一种系统化的方法，用于对小芯片互连的逻辑进行建模、仿真和测试，其中该模型以逻辑向量的形式表示。其基本范式是：任何逻辑都应针对结构或功能中显式或隐式存在的“正常值”模型中的逻辑故障，进行系统性的测试。小芯片架构中各组件或总线互连的任何物理缺陷，最终都会表现为逻辑故障。缺陷会破坏任何计算设备的逻辑行为，包括总线结构。这意味着所有物理缺陷都将体现为逻辑故障，因此需要生成能够覆盖各种逻辑故障组合的系统测试方案。\n\n为此，本文提供了一种“建模测试卡”，它描述了全面测试与所有逻辑故障组合之间的逻辑关系。仅需一个逻辑向量，即可通过三个矩阵运算完成对小芯片互连测试图的建模。此外，任何结构和功能均可通过逻辑向量来建模测试图。同时，逻辑向量也是一种可用于图形化呈现过程或现象模型有效性的数据结构。逻辑向量是最简单的模型形式，既便于计算机仿真，也利于向人类直观展示结果。基于逻辑向量的建模与可视化呈现，在解决市场实际问题方面相辅相成。\n\n文中给出了对总线、图结构及功能进行测试图建模与图形化渲染的示例及其处理时间。所有用于结构与功能测试图建模与可视化的机制均已嵌入Python语言代码中，并作为开源应用程序发布于网络空间。"
  },
  {
    "date": "2025-12-29",
    "title": "Gate-Breaker: An LLM-Powered Netlist-to-RTL Reverse Engineering Tool",
    "authors": "Md Omar Faruque, Peter Jamieson, Ahmad Patooghy, Abdel-Hameed A. Badawy",
    "publish": "2025 IEEE International Performance, Computing, and Communications Conference (IPCCC)",
    "url": "https://doi.org/10.1109/ipccc66453.2025.11304682",
    "source": "IEEE",
    "abstract": "The escalating sophistication of hardware intellectual property (IP) theft, a multi-billion dollar problem for the semiconductor industry, demands novel approaches to both understanding attack vectors and fortifying defenses. This paper evaluates the potential of Large Language Models (LLMs) to reverse engineer Register Transfer Level (RTL) designs from gate-level netlists. We introduce a framework for netlist-to-RTL conversion, leveraging pattern recognition and code generation capabilities of modern LLMs. Our evaluation of four available LLM models across 156 circuit benchmarks reveals that LLMs can indeed recover functional RTL with reasonable accuracy until the RTL benchmarks become our classified 4th quartile of code complexity. We also provide a similarity metrics-based methodology to evaluate and ascertain the quality of reverse engineering. Among the evaluated models, OpenAI's O3-Mini emerged as the best performer with 75.1 % overall success rate. While performance degrades significantly on the most complex 4th quartile (53.4 % success rate), when O3-Mini does succeed on these challenging designs, it maintains a high Abstract Syntax Tree (AST) similarity of 0.924 and achieves a moderate 0.871 Control Flow Graph (CFG) similarity.",
    "title_zh": "打破门禁：一种基于大语言模型的网表到RTL逆向工程工具",
    "abstract_zh": "硬件知识产权（IP）盗窃问题日益复杂，已成为半导体行业价值数十亿美元的重大挑战，迫切需要新的方法来理解攻击途径并加强防御措施。本文评估了大语言模型（LLMs）从门级网表逆向工程恢复寄存器传输级（RTL）设计的潜力。我们提出了一种网表到RTL转换的框架，利用现代大语言模型的模式识别和代码生成能力。通过对四个现有LLM模型在156个电路基准上的评估，我们发现LLM确实能够在RTL基准尚未达到我们分类的第四复杂度四分位数时，以合理的准确率恢复功能性的RTL代码。我们还提出了一种基于相似性度量的方法，用于评估和确定逆向工程的质量。在所评估的模型中，OpenAI的O3-Mini表现最佳，总体成功率达到75.1%。尽管在最复杂的第四四分位数上性能显著下降（成功率为53.4%），但当O3-Mini成功处理这些复杂设计时，其抽象语法树（AST）相似性仍高达0.924，控制流图（CFG）相似性也达到了中等水平的0.871。"
  },
  {
    "date": "2025-12-29",
    "title": "Hardware Trojan Detection with Explainable Graph Learning Using XGBoost Algorithm",
    "authors": "C Sneha, M Nirmala Devi",
    "publish": "2025 IEEE International Conference on Electronics, Computing and Communication Technologies (CONECCT)",
    "url": "https://doi.org/10.1109/conecct65861.2025.11306889",
    "source": "IEEE",
    "abstract": "In today’s world of interdependencies, hardware security is viewed as a crucial component in system designs and production. As Integrated circuits (ICs) become more complex with the globalization of the semiconductor supply chain, one of the significant threats to hardware security is the Hardware Trojans (HTs). Hardware Trojans are malicious alterations intentionally implanted into a circuit to compromise its performance, reliability or security. There are many Machine- Learning (ML) based hardware trojan detection techniques proposed over the years which yielded better results than traditional methods but they still continue to encounter challenges with ad-hoc feature selection, detection accuracy and black-box nature of machine learning models. The proposed work presents a comprehensive structure to detect HTs at the gate-level netlist using machine learning techniques based on Graph Learning (GL). To overcome constant feature engineering associated with structural features, the gate-level-netlist is converted into Data Flow Graph (DFG) from which structural and graph centrality measures are extracted along with functional features thereby considering heterogenous features to increase the detection accuracy and coverage. It provides efficient techniques to overcome ad-hoc feature selection by incorporating techniques such as SHapley Additive exPlanations (SHAP) and Local Interpretable Model-agnostic Explanation (LIME) where they also contribute towards the explainability of the blackbox model’s interpretations serving dual purpose. The eXtreme Gradient Boosting (XGBoost) model is used as a classifier. The experimental results projected that the proposed SHAP based XGBoost model evaluated on combinational circuits from TrustHUB benchmarks achieves a remarkable accuracy of 99.16%.",
    "title_zh": "基于XGBoost算法的可解释图学习硬件木马检测",
    "abstract_zh": "在当今相互依存的世界中，硬件安全被视为系统设计与生产中的关键组成部分。随着集成电路（IC）的日益复杂以及半导体供应链的全球化，硬件安全面临的一个重大威胁便是硬件木马（Hardware Trojans, HTs）。硬件木马是指被恶意故意植入电路中的篡改模块，旨在破坏电路的性能、可靠性或安全性。多年来，已有许多基于机器学习（ML）的硬件木马检测技术被提出，其效果优于传统方法，但仍面临特征选择随意性大、检测准确率不足以及机器学习模型“黑箱”特性带来的可解释性差等挑战。\n\n本文提出了一种基于图学习（Graph Learning, GL）的机器学习框架，用于在门级网表层面全面检测硬件木马。为克服传统结构特征提取中持续依赖人工特征工程的问题，本研究将门级网表转换为数据流图（Data Flow Graph, DFG），从中提取结构特征与图中心性指标，并结合功能特征，形成异构特征集，从而提升检测的准确率与覆盖范围。为进一步解决特征选择的随意性问题，本方法引入了SHapley Additive exPlanations（SHAP）和局部可解释模型无关解释（LIME）等技术，不仅优化了特征选择过程，还增强了对“黑箱”模型决策结果的可解释性，实现双重目标。分类器采用eXtreme Gradient Boosting（XGBoost）模型。实验结果表明，所提出的基于SHAP的XGBoost模型在TrustHUB基准测试集的组合电路上的评估准确率高达99.16%，表现出卓越的检测性能。"
  }
]