[
  {
    "date": "2026-01-06",
    "title": "LAsset: An LLM-assisted Security Asset Identification Framework for System-on-Chip (SoC) Verification",
    "authors": "Md Ajoad Hasan, Dipayan Saha, Khan Thamid Hasan, Nashmin Alam, Azim Uddin, Sujan Kumar Saha, Mark Tehranipoor, Farimah Farahmandi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2601.02624v1",
    "source": "arXiv",
    "abstract": "The growing complexity of modern system-on-chip (SoC) and IP designs is making security assurance difficult day by day. One of the fundamental steps in the pre-silicon security verification of a hardware design is the identification of security assets, as it substantially influences downstream security verification tasks, such as threat modeling, security property generation, and vulnerability detection. Traditionally, assets are determined manually by security experts, requiring significant time and expertise. To address this challenge, we present LAsset, a novel automated framework that leverages large language models (LLMs) to identify security assets from both hardware design specifications and register-transfer level (RTL) descriptions. The framework performs structural and semantic analysis to identify intra-module primary and secondary assets and derives inter-module relationships to systematically characterize security dependencies at the design level. Experimental results show that the proposed framework achieves high classification accuracy, reaching up to 90% recall rate in SoC design, and 93% recall rate in IP designs. This automation in asset identification significantly reduces manual overhead and supports a scalable path forward for secure hardware development.",
    "title_zh": "LAsset：一种基于大语言模型的片上系统（SoC）安全资产识别验证框架",
    "abstract_zh": "现代片上系统（SoC）和IP设计的日益复杂化使得安全保证变得愈发困难。在硬件设计的硅前安全验证中，一个基础性步骤是识别安全资产，因为这一步骤对下游的安全验证任务——如威胁建模、安全属性生成和漏洞检测——具有重大影响。传统上，安全资产由安全专家手动确定，耗时且高度依赖专业知识。为应对这一挑战，本文提出LAsset，一种新颖的自动化框架，利用大语言模型（LLM）从硬件设计规范和寄存器传输级（RTL）描述中自动识别安全资产。该框架通过结构和语义分析，识别模块内部的主要和次要资产，并推导模块间的关联关系，从而在设计层面系统性地刻画安全依赖性。实验结果表明，所提出的框架具有较高的分类准确率，在SoC设计中最高达到90%的召回率，在IP设计中达到93%的召回率。这种资产识别的自动化显著减少了人工开销，为安全硬件开发提供了可扩展的前进路径。"
  },
  {
    "date": "2026-1-6",
    "title": "Generation of Synthesizable Verilog Code from Natural Language Specifications",
    "authors": "Daniil S. Yashchenko, Aleksandr Y. Romanov, Roman A. Solovyev, Dmitry V. Telpukhov, Artur A. Ziazetdinov",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3651684",
    "source": "IEEE",
    "abstract": "This study presents a method for generating synthesizable Verilog code for digital integrated circuits directly from natural-language specifications. The approach combines large language models with parameter-efficient fine-tuning—specifically, Low-Rank Adaptation and Quantized Low-Rank Adaptation—together with a specialized corpus of specification–code pairs that covers common design patterns and varying task complexity. The pipeline includes automated compilation, simulation, and synthesizability checks to ensure that outputs are both syntactically correct and suitable for downstream tool flows. Evaluation is performed using the pass-at-k metric on the standardized VerilogEval benchmark. The fine-tuned models substantially improve functional correctness over untuned baselines, achieving pass-at-k of up to 0.88 while markedly reducing both syntax and logic errors. The results indicate that reliable Verilog code generation from natural language can be achieved under constrained compute budgets; in our setup, effective training and inference remained feasible on a single graphics processing unit. Beyond empirical gains, the method demonstrates practical value for design automation by shortening iteration cycles and lowering the effort needed to move from textual requirements to synthesizable hardware modules. Overall, the findings support the use of large language models, paired with targeted data and validation, as a viable pathway for Verilog code generation and for accelerating the development of complex digital devices.",
    "title_zh": "从自然语言描述生成可综合的Verilog代码",
    "abstract_zh": "本研究提出了一种直接从自然语言描述生成可综合的数字集成电路Verilog代码的方法。该方法结合了大语言模型与参数高效微调技术——特别是低秩适应（Low-Rank Adaptation）和量化低秩适应（Quantized Low-Rank Adaptation）——并利用一个专门构建的规范-代码配对语料库，涵盖常见的设计模式和不同复杂度的任务。该流程包含自动化的编译、仿真和可综合性检查，以确保输出结果在语法上正确，并适用于后续的工具链流程。在标准化的VerilogEval基准测试上，采用pass-at-k指标进行评估。经过微调的模型在功能正确性方面显著优于未经微调的基线模型，最高pass-at-k达到0.88，同时大幅减少了语法和逻辑错误。实验结果表明，在有限计算资源条件下，仍可实现从自然语言到可靠Verilog代码的生成；在本研究设置中，有效的训练与推理均可在单块图形处理器（GPU）上完成。除了实证性能提升外，该方法在设计自动化方面展现出实际应用价值，能够缩短迭代周期，降低从文本需求转化为可综合硬件模块所需的工作量。总体而言，研究结果支持将大语言模型与针对性数据及验证机制相结合，作为Verilog代码生成的一种可行路径，并有望加速复杂数字器件的开发进程。"
  },
  {
    "date": "2026-1-6",
    "title": "Timing-Based Side-Channel Attack on DDR4 Memory in FPGA Cloud Environments",
    "authors": "Vineet Chadalavada, Naseeruddin Lodge, Dhruva Aklekar, Fareena Saqib",
    "publish": "2025 IEEE Physical Assurance and Inspection of Electronics (PAINE)",
    "url": "https://doi.org/10.1109/paine66113.2025.11320188",
    "source": "IEEE",
    "abstract": "Multi-tenant FPGA cloud platforms present serious security challenges due to the shared nature of hardware resources, particularly memory. One major security risk in such environments is the threat of side-channel attacks. This work demonstrates that the Prime+Probe attack, traditionally implemented to target CPU caches, can be adapted to DDR4 memory by taking advantage of timing variations caused by contention at the row buffer level. By creating controlled memory conflicts using custom attacker and victim kernels on a Xilinx Alveo U250 accelerator, we measured variations in memory access latency that revealed the victim's access to specific memory rows. These timing variations expose access behavior and enable inference of memory usage patterns, even without shared memory or runtime interaction between the attacker and victim. Our results demonstrate that DDR4 memory, when shared between tenants, can leak information through timing-based side channels. The findings point to the need for stronger isolation strategies and improved resource management to secure multi-tenant FPGA systems against such vulnerabilities.",
    "title_zh": "基于时序的侧信道攻击在FPGA云环境中对DDR4内存的攻击",
    "abstract_zh": "多租户FPGA云平台由于硬件资源（尤其是内存）的共享特性，面临着严峻的安全挑战。此类环境中的一个主要安全风险是侧信道攻击的威胁。本文研究表明，原本用于攻击CPU缓存的“探测+抢占”（Prime+Probe）攻击，可通过利用行缓冲器（row buffer）级别争用所导致的时序变化，被改造并应用于DDR4内存。我们在Xilinx Alveo U250加速器上设计了定制的攻击者和受害者内核，通过制造受控的内存冲突，测量到内存访问延迟的变化，从而揭示出受害者对特定内存行的访问行为。这些时序差异暴露了访问模式，使得即使在攻击者与受害者之间没有共享内存或运行时交互的情况下，也能推断出对方的内存使用情况。实验结果表明，在租户间共享的DDR4内存可能通过基于时序的侧信道泄露信息。该发现凸显出必须采用更强的隔离策略和更优的资源管理机制，以防范此类漏洞，保障多租户FPGA系统的安全性。"
  },
  {
    "date": "2026-1-6",
    "title": "Multi-Granular Information Flow Tracking in RISC-V Based SoCs",
    "authors": "Dhruvakumar Aklekar, Vineet Chadalavada, Nahush Tambe, Fareena Saqib",
    "publish": "2025 IEEE Physical Assurance and Inspection of Electronics (PAINE)",
    "url": "https://doi.org/10.1109/paine66113.2025.11320219",
    "source": "IEEE",
    "abstract": "In modern system-on-chip (SoC) designs, the use of proprietary third-party IPs (3PIPs) offers modularity and performance benefits, but may compromise on transparency and raise concerns on data confidentiality. Attacks such as buffer overflows targeting security-critical modules can bypass traditional protection and require robust runtime security mechanisms. In this work a Multi-Granular Information Flow Tracking (MG-IFT) framework is proposed that enforces secure data flow policies across different abstraction levels. The framework addresses the limitations of single-level IFT. The Multi-Granular IFT (MG-IFT) approach combines ISA-IFT for system-wide coverage and integrates Gate Level IFT (GLIFT) to the security-critical units, such as cryptographic modules. Performance achieves high precision without significant resource overhead. A hardware implementation of ISA-IFT is demonstrated in the PicoRV32 core. The results demonstrate the feasibility of deploying MG-IFT in real hardware, moving beyond conceptual models toward implementable security-enhanced SoCs.",
    "title_zh": "基于RISC-V的SoC中多粒度信息流追踪",
    "abstract_zh": "在现代片上系统（SoC）设计中，使用专有的第三方IP核（3PIPs）虽然带来了模块化和性能上的优势，但也可能牺牲透明度，并引发数据机密性方面的担忧。针对安全关键模块的缓冲区溢出等攻击可能绕过传统保护机制，因此需要强大的运行时安全机制。本文提出了一种多粒度信息流追踪（MG-IFT）框架，可在不同抽象层次上实施安全的数据流策略，克服了单一层次信息流追踪（IFT）的局限性。该多粒度IFT（MG-IFT）方法结合了面向全系统的指令集架构级IFT（ISA-IFT），并在加密模块等安全关键单元中集成门级IFT（GLIFT），在实现高精度的同时未带来显著的资源开销。文中在PicoRV32核心上实现了ISA-IFT的硬件原型，结果表明MG-IFT可在真实硬件中部署，推动了从概念模型向可实现的安全增强型SoC的转变。"
  },
  {
    "date": "2026-1-6",
    "title": "Project Foxtrot: Abstracting the Complexity of Bitstream Reverse Engineering Through ML",
    "authors": "Alexandre Proulx, Tarek Ould-Bachir, Nora Boulahia-Cuppens, Frédéric Cuppens",
    "publish": "2025 IEEE Physical Assurance and Inspection of Electronics (PAINE)",
    "url": "https://doi.org/10.1109/paine66113.2025.11320186",
    "source": "IEEE",
    "abstract": "Field-programmable gate arrays (FPGAs) face substantial security threats due to their inherent reconfigurability, heavy reliance on third-party intellectual property (3PIP) blocks, and increasing deployment in safety-critical domains. To compound these challenges, the proprietary nature of FPGA bitstreams hinders the ability to verify designs against potential threats such as hardware Trojans. Given these security challenges, prior works have proposed reverse engineering (RE) solutions to recover netlist information from bitstreams for security analysis. However, these solutions are FPGA-specific and require an exhaustive mapping between the netlist functions and bitstream bits. This paper introduces Project Foxtrot, a novel, vendor-agnostic framework for FPGA bitstream RE. Our framework leverages machine learning (ML) to simplify and accelerate the bitstream mapping process. It addresses the limitations of previous works by providing a universal approach that can be adapted to various FPGA vendors. The work presented focuses on the ML techniques integrated within our framework. We demonstrate how these techniques are used to abstract complex, time-consuming tasks, thereby making the process more efficient and scalable. We present our framework and demonstrate the effectiveness of our approach using a lookup table (LUT) recovery use case. Our experiments, conducted on the Intel-Altera Flex 10K, the AMD-Xilinx Spartan 7, and the AMD-Xilinx Artix 7 FPGAs, show perfect accuracy in LUT truth table recovery, surpassing recent state-of-the-art approaches.",
    "title_zh": "项目Foxtrot：通过机器学习抽象化比特流逆向工程的复杂性",
    "abstract_zh": "现场可编程门阵列（FPGA）由于其固有的可重构性、对第三方知识产权（3PIP）模块的高度依赖，以及在安全关键领域的日益广泛应用，面临着严重的安全威胁。更为复杂的是，FPGA比特流的专有性质阻碍了对硬件木马等潜在威胁进行设计验证的能力。针对这些安全挑战，先前的研究提出了逆向工程（RE）方法，以从比特流中恢复网表信息用于安全分析。然而，这些方法通常针对特定FPGA厂商，且需要在网表功能与比特流位之间建立详尽的映射关系。\n\n本文提出“Project Foxtrot”——一种新颖的、与厂商无关的FPGA比特流逆向工程框架。该框架利用机器学习（ML）技术简化并加速比特流映射过程，克服了以往方法的局限性，提供了一种可适用于不同FPGA厂商的通用解决方案。本文重点介绍该框架中集成的机器学习技术，展示了这些技术如何用于抽象化复杂且耗时的任务，从而提升整个流程的效率和可扩展性。我们通过一个查找表（LUT）恢复的应用案例，展示了该框架的有效性。在Intel-Altera Flex 10K、AMD-Xilinx Spartan 7 和 AMD-Xilinx Artix 7 FPGA 上开展的实验表明，我们的方法在LUT真值表恢复方面实现了100%的准确率，优于近期最先进的同类方法。"
  },
  {
    "date": "2026-1-6",
    "title": "Wearable Exoskeleton-Based Immersive Teleoperation for Industrial Manufacturing Systems: Hardware Design and Verification",
    "authors": "Guangwei Zhang, Ruohan Wang, Mengke Wang, Honghao Lyu, Dapeng Lan, Dashun Zhang, Geng Yang",
    "publish": "2025 IEEE 23rd International Conference on Industrial Informatics (INDIN)",
    "url": "https://doi.org/10.1109/indin64977.2025.11279561",
    "source": "IEEE",
    "abstract": "Currently, robots face significant challenges in independently completing tasks within dynamic and unstructured environments. Teleoperation systems that utilize exoskeletons as input devices present an effective solution to this issue. This paper introduces an ergonomic 7-degree-of-freedom (7-DOF) exoskeleton device and develops an immersive teleoperation system integrated with a virtual reality (VR) head-mounted display (HMD). In this system, the operator, serving as the master side, dons the exoskeleton to issue control commands to the slave-side robot while leveraging feedback from both the exoskeleton and the VR HMD for cognitive decision-making. This closed-loop teleoperation system provides a multi-sensory feedback experience that integrates visual and haptic sensations, significantly enhancing operational stability and accuracy. Furthermore, for force feedback control, we propose a strategy based on environmental parameter estimation in conjunction with Weber’s law, allowing for self-adaptive adjustments of force feedback mapping in response to varying environmental conditions. Experimental results indicate that operators experience a high level of immersion with this system and successfully complete tasks such as remote ultrasound detection. The system demonstrates superior performance in terms of stability, accuracy, and user adaptability, highlighting its potential for complex remote operations in dynamic and unstructured environments.",
    "title_zh": "面向工业制造系统的可穿戴外骨骼沉浸式遥操作：硬件设计与验证",
    "abstract_zh": "目前，机器人在动态且非结构化的环境中独立完成任务仍面临巨大挑战。采用外骨骼作为输入设备的遥操作系统为此问题提供了一种有效的解决方案。本文介绍了一款符合人体工程学设计的七自由度（7-DOF）外骨骼装置，并构建了一个集成虚拟现实（VR）头戴式显示器（HMD）的沉浸式遥操作系统。在该系统中，操作者作为主端佩戴外骨骼向从端机器人发送控制指令，同时利用来自外骨骼和VR HMD的反馈进行认知决策。这一闭环遥操作系统融合了视觉与触觉的多感官反馈体验，显著提升了操作的稳定性与准确性。此外，在力反馈控制方面，我们提出了一种结合环境参数估计与韦伯定律的策略，可根据不同环境条件自适应地调整力反馈映射关系。实验结果表明，操作者在使用该系统时具有高度的沉浸感，并成功完成了远程超声检测等任务。该系统在稳定性、精确性以及用户适应性方面均表现出优越性能，展现出在复杂动态非结构化环境中执行远程作业的巨大应用潜力。"
  },
  {
    "date": "2026-1-6",
    "title": "RflySimSaT: A Safety Assessment Platform for UAVs Based on Hardware-in-the-loop Simulation",
    "authors": "Xunhua Dai, Jinhu Tu, Yong Chen, Quan Quan",
    "publish": "IEEE Transactions on Automation Science and Engineering",
    "url": "https://doi.org/10.1109/tase.2026.3651543",
    "source": "IEEE",
    "abstract": "As unmanned aerial vehicles (UAVs) lead the way in the development of future digital smart cities, they continue to face scrutiny due to safety concerns. While robotics simulators offer UAVs efficient and cost-effective testing environments, they often lack comprehensive safety design considerations and user testing requirements. In this study, we introduce RflySimSaT, a dedicated safety testing platform for UAVs that addresses safety factors throughout the entire lifecycle. This platform incorporates diverse fault testing scenarios, high-fidelity dynamic models, an integrated safety assessment framework, standardized testing procedures, and customizable interfaces. The modular architecture and deployment of RflySimSaT facilitate plug-and-play cross-platform closed-loop safety testing. Users simply need to supply their aircrafts and autopilots, enabling them to efficiently navigate the phases of development, deployment, testing, and assessment using the customizable modules and standardized processes offered by the platform. To validate RflySimSaT’s credibility and versatility, we designed various test cases that demonstrate its practicality and scalability. Additionally, we provide a comprehensive user manual, detailed case studies, and a rich fault dataset. The platform is open-source and available at: https://github.com/RflySim/RFlySimSafe/tree/RflySimSaT.",
    "title_zh": "RflySimSaT：一种基于硬件在环仿真的无人机安全评估平台",
    "abstract_zh": "随着无人机（UAV）引领未来数字化智慧城市的发展，其安全性问题持续受到关注。尽管机器人仿真器为无人机提供了高效且低成本的测试环境，但这些仿真器往往缺乏全面的安全性设计考量和用户测试需求。在本研究中，我们提出了RflySimSaT——一个专为无人机设计的综合性安全测试平台，涵盖无人机全生命周期的安全因素。该平台集成了多样化的故障测试场景、高保真动态模型、一体化的安全评估框架、标准化的测试流程以及可定制的接口。RflySimSaT采用模块化架构并支持灵活部署，实现了即插即用的跨平台闭环安全测试。用户只需提供自己的飞行器和飞控系统，即可借助平台提供的可定制模块和标准化流程，高效完成开发、部署、测试与评估各阶段工作。为验证RflySimSaT的可信度与通用性，我们设计了多种测试用例，充分展示了平台的实用性与可扩展性。此外，我们还提供了详尽的用户手册、具体的案例研究以及丰富的故障数据集。该平台已开源，代码获取地址为：https://github.com/RflySim/RFlySimSafe/tree/RflySimSaT。"
  },
  {
    "date": "2026-1-6",
    "title": "Differential Power Attack Analysis on Novel ZUC-PRN Using VAMAN-BB4 Board",
    "authors": "Jayati Dutta, Errala Paulsonashish, Priyanka Peri, Rohith Malkuchi",
    "publish": "2025 IEEE 102nd Vehicular Technology Conference (VTC2025-Fall)",
    "url": "https://doi.org/10.1109/vtc2025-fall65116.2025.11310098",
    "source": "IEEE",
    "abstract": "The rapid advancement of wireless communication technologies is exemplified by the emergence of 5GAdvanced and the anticipated 6G era. While 5G-Advanced enhances current capabilities, 6G aims to integrate AI-driven intelligence and advanced cryptographic techniques to strengthen security. This paper investigates the ZUCPRN model [1], a neural network-based cipher, designed to enhance wireless security in 5G and 6G networks. Although ZUC-PRN has the potential to replace traditional FSM-based ciphers, its resistance to various attacks remain unverified. We evaluate its susceptibility to Differential Power Analysis (DPA) attacks, comparing its security with the standard ZUC stream cipher. The analysis is conducted using a dedicated hardware-based testbench setup featuring the VAMAN board. This study offers key insights into the security and efficiency of the ZUC-PRN model, contributing to the advancement of more resilient encryption techniques for next-generation communication systems.",
    "title_zh": "基于VAMAN-BB4开发板对新型ZUC-PRN的差分功耗攻击分析",
    "abstract_zh": "无线通信技术的快速发展体现在5G-Advanced的出现以及即将到来的6G时代。尽管5G-Advanced增强了现有能力，6G的目标则是融合由人工智能驱动的智能功能和先进的加密技术，以加强安全性。本文研究了一种基于神经网络的密码——ZUC-PRN模型[1]，该模型旨在增强5G和6G网络中的无线安全。虽然ZUC-PRN有潜力取代传统的基于有限状态机（FSM）的密码，但其对各种攻击的抵抗能力尚未得到验证。我们评估了其遭受差分功耗分析（DPA）攻击的脆弱性，并将其安全性与标准ZUC流密码进行了比较。分析通过基于专用硬件的测试平台进行，该平台采用VAMAN开发板实现。本研究为ZUC-PRN模型的安全性和效率提供了关键见解，有助于推动下一代通信系统中更强大加密技术的发展。"
  },
  {
    "date": "2026-1-6",
    "title": "Precision Strike: Targeted Misclassification of Accelerated CNNs with a Single Clock Glitch",
    "authors": "Arsalan Ali Malik, Furkan Aydin, Aydin Aysu",
    "publish": "2025 IEEE Physical Assurance and Inspection of Electronics (PAINE)",
    "url": "https://doi.org/10.1109/paine66113.2025.11320182",
    "source": "IEEE",
    "abstract": "Fault injection attacks (FIAs) present a significant threat to the integrity of deep neural networks (DNNs), particularly in hardware-accelerated deployments on field-programmable gate arrays (FPGAs). These attacks intentionally introduce faults into the system, leading the DNN to generate incorrect outputs. This work presents the first successful targeted misclassification attack against a convolutional neural network (CNN) implemented on FPGA hardware, achieved by injecting a single clock glitch at the final layer (argmax) to manipulate the predicted output class. Our attack targets the commonly adopted argmax layer, a lightweight replacement for softmax in resource-constrained implementations. By precisely injecting a single clock glitch during the comparison phase of the argmax operation, the attack reliably induces misclassifications, forcing the model to 'skip' a specifically chosen class and output an incorrect label for it without affecting the computed scores of other classes. Unlike prior works that only cause random misclassifications, our attack achieves a high success rate of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$80-87 \\%$</tex> for a targeted class, without inducing collateral misclassifications of other classes. Our evaluations show a significant reduction in classification accuracy, with the model's performance dropping from an initial 94.7 % to an average final accuracy ranging from <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$7.7-14.7 \\%$</tex>. Our attack is demonstrated on a CNN model implemented using a common systolic array architecture, which is well-suited for resource-constrained edge devices and artificial intelligence (AI) accelerators. Our study confirms the vulnerability of hardware-accelerated machine learning systems to low-cost physical attacks, emphasizing the critical need for hardware-level countermeasures in safety-critical machine learning applications.",
    "title_zh": "精准攻击：通过单次时钟故障实现对加速CNN的定向误分类",
    "abstract_zh": "故障注入攻击（FIA）对深度神经网络（DNN）的完整性构成了重大威胁，尤其是在现场可编程门阵列（FPGA）上进行硬件加速部署时。此类攻击通过在系统中故意引入故障，导致DNN产生错误的输出。本文首次成功实现了针对在FPGA硬件上实现的卷积神经网络（CNN）的定向错误分类攻击：仅通过在最后一层（argmax层）注入单个时钟毛刺，即可操控模型的预测输出类别。我们的攻击针对的是资源受限实现中广泛采用的轻量级argmax层（用于替代softmax）。通过在argmax操作的比较阶段精确注入单个时钟毛刺，该攻击能够可靠地引发错误分类，迫使模型“跳过”某个特定目标类别，并为该类别输出错误标签，而不会影响其他类别的计算得分。与以往仅导致随机误分类的研究不同，我们的攻击对目标类别的成功率高达80–87%，且不会对其他类别造成连带误分类。实验结果表明，该攻击显著降低了分类准确率，使模型性能从初始的94.7%下降至最终平均准确率仅为7.7–14.7%。我们在一种常见的脉动阵列架构上实现了该CNN模型，这种架构非常适合资源受限的边缘设备和人工智能（AI）加速器。本研究证实了硬件加速的机器学习系统极易受到低成本物理攻击的影响，凸显了在安全关键型机器学习应用中部署硬件级防护措施的迫切需求。"
  }
]